In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 25.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
df=pd.DataFrame({"Name":["vanita","megha","soniya"],
                "Age":[20,18,20],
                "city":["amb","mohali","amb"]})
df

     Name  Age    city
0  vanita   20     amb
1   megha   18  mohali
2  soniya   20     amb

In [3]:
df.to_csv("about.csv",index = False)
df = pd.read_csv("about.csv")
df

     Name  Age    city
0  vanita   20     amb
1   megha   18  mohali
2  soniya   20     amb

In [4]:
data = pd.Series([1,2,3,4,5,6,7])
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [5]:
print(type(data))

<class 'pandas.core.series.Series'>

In [6]:
data1 = pd.DataFrame({"Name" : ["Vanita", "Jack", "Mack", "Mont"],
                      "Age" : [20, 21, 23, 22],
                     "Gender" : ["F", "M","F","M"]})

In [7]:
data1.to_csv("first_DataFrame.csv",index = False)

In [8]:
new_data = pd.read_csv("first_DataFrame.csv")

In [9]:
new1=pd.DataFrame({"Name":["akku","vinu","megha","aru","arnav"],
                  "Age":[20,22,18,13,9],
                 "city":["amb","amb","mohali","mohali","mohali"]})
new1

    Name  Age    city
0   akku   20     amb
1   vinu   22     amb
2  megha   18  mohali
3    aru   13  mohali
4  arnav    9  mohali

In [10]:
new1.to_csv("2ndDataframe.csv")##index=False)
dat=pd.read_csv("2ndDataframe.csv")
dat

   Unnamed: 0   Name  Age    city
0           0   akku   20     amb
1           1   vinu   22     amb
2           2  megha   18  mohali
3           3    aru   13  mohali
4           4  arnav    9  mohali

In [11]:
new1.to_csv("2ndDataframe.csv",index=False)
dat=pd.read_csv("2ndDataframe.csv")
dat

    Name  Age    city
0   akku   20     amb
1   vinu   22     amb
2  megha   18  mohali
3    aru   13  mohali
4  arnav    9  mohali

In [12]:
import pandas as pd
data=pd.read_csv("2ndDataframe.csv")

In [13]:
data.head()

    Name  Age    city
0   akku   20     amb
1   vinu   22     amb
2  megha   18  mohali
3    aru   13  mohali
4  arnav    9  mohali

In [14]:
data.tail(2)

    Name  Age    city
3    aru   13  mohali
4  arnav    9  mohali

In [15]:
data.head(3)

    Name  Age    city
0   akku   20     amb
1   vinu   22     amb
2  megha   18  mohali

In [16]:
data=data.replace(to_replace=20,value=12)
data

    Name  Age    city
0   akku   12     amb
1   vinu   22     amb
2  megha   18  mohali
3    aru   13  mohali
4  arnav    9  mohali

In [17]:
data.isnull().sum()

Name    0
Age     0
city    0
dtype: int64

In [18]:
data.isnull()

    Name    Age   city
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [19]:
data.dropna(how="all")

    Name  Age    city
0   akku   12     amb
1   vinu   22     amb
2  megha   18  mohali
3    aru   13  mohali
4  arnav    9  mohali

In [20]:
data.dropna(how="any")

    Name  Age    city
0   akku   12     amb
1   vinu   22     amb
2  megha   18  mohali
3    aru   13  mohali
4  arnav    9  mohali